# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [13]:
series1 = pd.Series(np.random.randint(1,4,100))
series2 = pd.Series(np.random.randint(1,3,100))
series3 = pd.Series(np.random.randint(10000,30000,100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [18]:
df = pd.DataFrame(data={"col1":series1,"col2":series2,"col3":series3})
df

    col1  col2   col3
0      3     2  14064
1      3     1  19709
2      3     2  10282
3      3     1  22503
4      1     2  13653
..   ...   ...    ...
95     2     2  28243
96     1     1  22201
97     3     1  26714
98     2     2  16449
99     1     2  23062

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [19]:
df.columns = ["bedrs","bathrs","price_sqr_meter"]
df

    bedrs  bathrs  price_sqr_meter
0       3       2            14064
1       3       1            19709
2       3       2            10282
3       3       1            22503
4       1       2            13653
..    ...     ...              ...
95      2       2            28243
96      1       1            22201
97      3       1            26714
98      2       2            16449
99      1       2            23062

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [21]:
bigcolumn = pd.concat([series1,series2,series3],axis=0)
bigcolumn = bigcolumn.to_frame()
bigcolumn

        0
0       3
1       3
2       3
3       3
4       1
..    ...
95  28243
96  22201
97  26714
98  16449
99  23062

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [24]:
# No
bigcolumn.shape[0]

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [31]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        3
1        3
2        3
3        3
4        1
..     ...
295  28243
296  22201
297  26714
298  16449
299  23062

[300 rows x 1 columns]